In [3]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import seaborn as sns
import sklearn
from math import sqrt

In [59]:
#Load train and test dataset

In [4]:
train = pd.read_csv(r"C:\Users\navin\Downloads\black-friday\train.csv")
test = pd.read_csv(r"C:\Users\navin\Downloads\black-friday\test.csv")

In [5]:
train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [6]:
test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [7]:
train.shape

(550068, 12)

In [8]:
datasets = [train,test]

In [1]:
#Cheching for Nan values in both the datasets

In [9]:
for dataset in datasets:
    print(dataset.isnull().sum())

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64
User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2             72344
Product_Category_3            162562
dtype: int64

In [2]:
#Mapping values to categorical data

In [10]:
for dataset in datasets:
    dataset["Gender"] = dataset["Gender"].map({"M":0,"F":1})
    dataset["Age"] = dataset["Age"].map({"0-17":0, "18-25":1, "26-35":2, "36-45":3, "46-50":4, "51-55":5, "55+":6})
    dataset["City_Category"] = dataset["City_Category"].map({"A":0, "B":1, "C":2})
    dataset["Stay_In_Current_City_Years"] = dataset["Stay_In_Current_City_Years"].map({"0":0, "1":1, "2":2, "3":3, "4+":4})

In [11]:
train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,1,0,10,0,2,0,3,NaN,NaN,8370
1,1000001,P00248942,1,0,10,0,2,0,1,6.0,14.0,15200
2,1000001,P00087842,1,0,10,0,2,0,12,NaN,NaN,1422
3,1000001,P00085442,1,0,10,0,2,0,12,14.0,NaN,1057
4,1000002,P00285442,0,6,16,2,4,0,8,NaN,NaN,7969

In [4]:
#Fill Nan values with 0 and change type to int

In [12]:
for dataset in datasets:
    dataset["Product_Category_2"] = dataset["Product_Category_2"].fillna(0)
    dataset["Product_Category_3"] = dataset["Product_Category_3"].fillna(0)

In [13]:
for dataset in datasets:
    dataset["Product_Category_2"] = dataset["Product_Category_2"].astype(int)
    dataset["Product_Category_3"] = dataset["Product_Category_3"].astype(int)

In [14]:
train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,1,0,10,0,2,0,3,0,0,8370
1,1000001,P00248942,1,0,10,0,2,0,1,6,14,15200
2,1000001,P00087842,1,0,10,0,2,0,12,0,0,1422
3,1000001,P00085442,1,0,10,0,2,0,12,14,0,1057
4,1000002,P00285442,0,6,16,2,4,0,8,0,0,7969

In [15]:
for dataset in datasets:
    print(dataset.isnull().sum())

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
dtype: int64
User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
dtype: int64

In [16]:
train.shape

(550068, 12)

In [17]:
test.shape

(233599, 11)

In [5]:
#Shuffling the data

In [18]:
train = sklearn.utils.shuffle(train)
test = sklearn.utils.shuffle(test)

In [6]:
#Using only train data with two different models to check which one is better

In [19]:
X = train.drop(["Purchase","User_ID","Product_ID"], axis = 1)
X.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
136689,0,2,7,0,1,0,8,0,0
209233,1,1,19,1,4,0,5,0,0
288609,0,1,0,1,1,0,1,2,8
36543,0,2,0,0,4,1,1,0,0
412351,1,3,7,2,1,0,5,0,0

In [20]:
y = train["Purchase"]
y.head()

136689    10045
209233     5199
288609    15601
36543      8195
412351     7118
Name: Purchase, dtype: int64

In [21]:
from sklearn import metrics

In [7]:
#Splitting train and test data in train dataframe

In [22]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.2)

**RANDOM FOREST REGRESSION**

In [23]:
from sklearn.ensemble import RandomForestRegressor

In [24]:
regressor = RandomForestRegressor(n_estimators=10, random_state=0)

In [25]:
regressor.fit(X_train,y_train)

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=10, n_jobs=None, oob_score=False,
                      random_state=0, verbose=0, warm_start=False)

In [26]:
y_pred=regressor.predict(X_test)

In [27]:
r2 = metrics.r2_score(y_test,y_pred)
print('R2 score =',r2)

R2 score = 0.6229379281098333

**XGBOOST**

In [41]:
import xgboost as xgb

In [42]:
xg_reg = xgb.XGBRegressor(objective ='reg:squarederror', colsample_bytree = 0.3, learning_rate = 0.1,
                max_depth = 5, alpha = 10, n_estimators = 5)

In [43]:
xg_reg.fit(X_train,y_train)

XGBRegressor(alpha=10, base_score=0.5, booster=None, colsample_bylevel=1,
             colsample_bynode=1, colsample_bytree=0.3, gamma=0, gpu_id=-1,
             importance_type='gain', interaction_constraints=None,
             learning_rate=0.1, max_delta_step=0, max_depth=5,
             min_child_weight=1, missing=nan, monotone_constraints=None,
             n_estimators=5, n_jobs=0, num_parallel_tree=1,
             objective='reg:squarederror', random_state=0, reg_alpha=10,
             reg_lambda=1, scale_pos_weight=1, subsample=1, tree_method=None,
             validate_parameters=False, verbosity=None)

In [44]:
y_pred=regressor.predict(X_test)

In [45]:
r2 = metrics.r2_score(y_test,y_pred)
print('R2 score =',r2)

R2 score = 0.6229379281098333

In [46]:
#Both give similiar accuracies, so using any one of these two to get target values in Test dataframe

In [49]:
features = train.drop(["Purchase","User_ID","Product_ID"], axis = 1)
features.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
136689,0,2,7,0,1,0,8,0,0
209233,1,1,19,1,4,0,5,0,0
288609,0,1,0,1,1,0,1,2,8
36543,0,2,0,0,4,1,1,0,0
412351,1,3,7,2,1,0,5,0,0

In [50]:
target = train["Purchase"]
target.head()

136689    10045
209233     5199
288609    15601
36543      8195
412351     7118
Name: Purchase, dtype: int64

In [53]:
prediction = test.drop(["User_ID","Product_ID"], axis = 1)
prediction.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
11604,0,2,1,2,1,1,16,0,0
103227,0,5,6,1,1,1,1,2,5
212020,0,3,3,0,2,0,5,8,0
142933,1,2,16,2,2,0,8,0,0
101684,0,2,20,0,4,0,5,7,0

In [51]:
from sklearn.ensemble import RandomForestRegressor
reg = RandomForestRegressor(n_estimators=10, random_state=0)
reg.fit(features, target)

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=10, n_jobs=None, oob_score=False,
                      random_state=0, verbose=0, warm_start=False)

In [54]:
y_pred=regressor.predict(prediction)

In [55]:
y_pred

array([16613.28888889, 14407.72666667,  5964.06857143, ...,
        8384.64285714,  6723.16368444,  8782.78333333])

In [8]:
#Producing final dataframe with Purchase column for test dataframe

In [57]:
finalpred = pd.DataFrame({"User_ID":test["User_ID"], "Product_ID":test["Product_ID"], "Gender":test["Gender"], "Age":test["Age"], "Occupation":test["Occupation"], "City_Category":test["City_Category"], "Stay_In_Current_City_Years":test["Stay_In_Current_City_Years"], "Marital_Status":test["Marital_Status"], "Product_Category_1":test["Product_Category_1"], "Product_Category_2":test["Product_Category_2"], "Product_Category_3":test["Product_Category_3"], "Purchase":y_pred})

In [58]:
finalpred.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
11604,1005938,P00031142,0,2,1,2,1,1,16,0,0,16613.288889
103227,1003108,P00014842,0,5,6,1,1,1,1,2,5,14407.726667
212020,1002962,P00285342,0,3,3,0,2,0,5,8,0,5964.068571
142933,1003927,P00032842,1,2,16,2,2,0,8,0,0,9252.854917
101684,1000710,P00188442,0,2,20,0,4,0,5,7,0,6384.452681